In [21]:
import pandas as pd
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import math as m
import pandas_datareader.data as web
string_data = pd.Series(['a','b',np.nan,'d'])
string_data

0      a
1      b
2    NaN
3      d
dtype: object

In [6]:
import pandas as pd
import numpy as np
string_data = pd.Series(['a','b',np.nan,'d'])
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
data = pd.Series([1,np.nan,3.5,np.nan,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [19]:
from numpy import nan as NA
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],
                    [NA,NA,NA],[NA,6.5,3.]])
cleaned = data.dropna(how='all') # how = all - 행이 모두 na 값인 행을 제외한다.
cleaned
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [23]:
df2 = df.fillna(0)
df2
df.fillna(0,inplace = True)

NameError: name 'df' is not defined

In [25]:
dic_data = {'k1':['one','two','one','two','one','two','two'],
           'k2':[1,1,2,3,3,4,4,]}
data = pd.DataFrame(dic_data)
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [28]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [30]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [33]:
data['v1'] = [0,1,2,3,4,5,6]
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [34]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [35]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]

In [36]:
bins = [18,25,35,60,100]

In [38]:
cats = pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [39]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [47]:
import re
text = 'foo bar\t baz \tqx'
print(text)

foo bar	 baz 	qx

In [49]:
re.split('\s+',text)

['foo', 'bar', 'baz', 'qx']

In [50]:
text = """Dave dave@google.com
Steve steve@google.com
Rob rob@goolge.com
Ryan ryan@google.com
"""
pattern = r'[A-Z-9._%+-]+@[A-Z0-9.-]+.[A-Z]{2,4}'
re1 = re.compile(pattern,flags=re.IGNORECASE)

In [51]:
re1.findall(text)

['dave@google.com', 'steve@google.com', 'rob@goolge.com', 'ryan@google.com']

In [52]:
data = pd.Series(np.random.randn(9),
                index=['a','a','a','b','b','c','c','d','d'])
data

a   -0.719276
a    0.794940
a   -1.420934
b    0.352022
b   -0.889424
c   -0.664602
c    0.693125
d    1.686975
d   -1.421398
dtype: float64

In [54]:
data = pd.Series(np.random.randn(9),
                index=[['a','a','a','b','b','c','c','d','d'],
                [1,2,3,1,2,1,2,1,2]])
data

a  1    0.712526
   2   -0.261797
   3   -0.371199
b  1    0.799384
   2    0.007656
c  1    0.003900
   2   -0.009231
d  1    1.040115
   2   -1.085318
dtype: float64

In [55]:
data['b']

1    0.799384
2    0.007656
dtype: float64

In [56]:
data.loc[['b','d']]

b  1    0.799384
   2    0.007656
d  1    1.040115
   2   -1.085318
dtype: float64

In [57]:
data.loc['b',2]

0.007656348742520805

In [67]:
df1 = pd.DataFrame({'key':['b','b','a','c','a','a','b'],
                   'data1':[0,1,2,3,4,5,6]})
df2 = pd.DataFrame({'key':['a','b','d'],
                   'data2':[0,1,2]})
df1
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [61]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [62]:
pd.merge(df1,df2,on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [68]:
df3 = pd.DataFrame({'lkey':['b','b','a','c','a','a','b'],
                   'data1':[0,1,2,3,4,5,6]})
df4 = pd.DataFrame({'rkey':['a','b','d'],
                   'data2':[0,1,2]})

In [69]:
pd.merge(df3,df4,left_on='lkey',
        right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0